In [ ]:
# задание 2
import pandas as pd
taxi = pd.read_csv(path_to_file)

In [29]:
# задание 3
import pandas as pd
taxi = pd.read_csv('/mnt/HC_Volume_18315164/home-jupyter/jupyter-s-bykov/lesson_2/2_taxi_nyc.csv')
taxi.shape

(29101, 14)

In [31]:
taxi.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29101 entries, 0 to 29100
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   pickup_dt     29101 non-null  object
 1   pickup_month  29101 non-null  object
 2   borough       26058 non-null  object
 3   pickups       29101 non-null  int64
 4   hday          29101 non-null  object
 5   spd           29101 non-null  float64
 6   vsb           29101 non-null  float64
 7   temp          29101 non-null  float64
 8   dewp          29101 non-null  float64
 9   slp           29101 non-null  float64
 10  pcp 01        29101 non-null  float64
 11  pcp 06        29101 non-null  float64
 12  pcp 24        29101 non-null  float64
 13  sd            29101 non-null  float64
dtypes: float64(9), int64(1), object(4)
memory usage: 3.1+ MB

In [ ]:
# операции с Series и DataFrame
# источник: https://khashtamov.com/ru/pandas-introduction/

In [12]:
# создаем серию, автоматический индекс
ser = pd.Series(['mary', 'ivan', 'nick'], name = 'Kids')
ser

0    mary
1    ivan
2    nick
Name: Kids, dtype: object

In [16]:
ser.index

RangeIndex(start=0, stop=3, step=1)

In [19]:
ser.values

array(['mary', 'ivan', 'nick'], dtype=object)

In [48]:
# явно заданный индекс
ser_2 = pd.Series(['mary', 'ivan', 'nick'], index = [0, 2, 4], name = 'Kids')
ser_2

0    mary
2    ivan
4    nick
Name: Kids, dtype: object

In [49]:
# то же самое, другой способ
ser_2 = pd.Series({0: 'mary', 2: 'ivan', 4: 'nick'}, name = 'Kids')
ser_2

0    mary
2    ivan
4    nick
Name: Kids, dtype: object

In [6]:
# то же самое, третий способ
ser_2 = pd.Series(['mary', 'ivan', 'nick'])
ser_2.index = [0, 2, 4,]
ser_2

0    mary
2    ivan
4    nick
dtype: object

In [7]:
# задаем имя серии
ser_2.name = 'Kids'
ser_2

0    mary
2    ivan
4    nick
Name: Kids, dtype: object

In [18]:
ser_2.index # Output отличается от автоматического индекса

Int64Index([0, 2, 4], dtype='int64')

In [20]:
ser_2.values

array(['mary', 'ivan', 'nick'], dtype=object)

In [21]:
ser[2] # вынимаем элемент по его индексу

'nick'

In [33]:
ser[[0, 2]] # вынимаем несколько элементов

0    mary
2    nick
Name: Kids, dtype: object

In [54]:
# изменение данных в строках
ser[0, 1] = 'kid'
ser[2] = 'baby'
ser

0     kid
1     kid
2    baby
Name: Kids, dtype: object

In [60]:
# добавляем строку
ser[3] = 'adult'
ser

0      kid
1      kid
2     baby
3    adult
Name: Kids, dtype: object

In [61]:
# фильтрация строк
ser[ser == 'kid']

0    kid
1    kid
Name: Kids, dtype: object

In [62]:
# фильтрация строк
ser[ser != 'kid']

2     baby
3    adult
Name: Kids, dtype: object

In [66]:
4 in ser

False

In [22]:
len(ser[2]) # считаем длину строки

4

In [4]:
# DataFrame == питоновский словарь, ключ == имя колонки, значения == данные в строках, колонка == pandas Series
df = pd.DataFrame({'name': ['mary', 'ivan', 'nick'], 'age': [10, 5, 3], 'hair': ['blond', 'brown', 'black']})
df

   name  age   hair
0  mary   10  blond
1  ivan    5  brown
2  nick    3  black

In [10]:
df.name # колонка DataFrame == pandas Series

0    mary
1    ivan
2    nick
Name: name, dtype: object

In [14]:
ser # колонка DataFrame == pandas Series

0    mary
1    ivan
2    nick
Name: Kids, dtype: object

In [30]:
df.values

array([['mary', 10, 'blond'],
       ['ivan', 5, 'brown'],
       ['nick', 3, 'black']], dtype=object)

In [15]:
df.columns

Index(['name', 'age', 'hair'], dtype='object')

In [29]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [24]:
# явно задаем индекс
df.index = ['first','second', 'third']
df.index

Index(['first', 'second', 'third'], dtype='object')

In [25]:
# задаем имя индекса
df.index.name = 'Item'
df

        name  age   hair
Item
first   mary   10  blond
second  ivan    5  brown
third   nick    3  black

In [26]:
# выводим колонку
df.name

Item
first     mary
second    ivan
third     nick
Name: name, dtype: object

In [28]:
# выводим строку по метке индекса
df.loc['first']

name     mary
age        10
hair    blond
Name: first, dtype: object

In [30]:
# или выводим строку по порядковому номеру индекса
df.iloc[0]

name     mary
age        10
hair    blond
Name: first, dtype: object

In [15]:
df.append({'name': 'lina', 'age': 40, 'hair': 'brown'}, ignore_index=True)

   name  age   hair
0  mary   10  blond
1  ivan    5  blond
2  nick    3  black
3  lina   40  brown

In [63]:
df = pd.DataFrame({'name': ['mary', 'ivan', 'nick', 'lina'], 'age': [10, 5, 3, 40], 'height': [150, 110, 65, 165], 'hair': ['blond', 'blond', 'black', 'brown']}, index = ['first','second', 'third', 'fourth'])
df

        name  age  height   hair
first   mary   10     150  blond
second  ivan    5     110  blond
third   nick    3      65  black
fourth  lina   40     165  brown

In [55]:
# выборка по индексу и колонке
df.loc[['first', 'third'], 'name']

first    mary
third    nick
Name: name, dtype: object

In [56]:
# выборка по слайсу индекса
df.loc['second':'fourth':2]

        name  age  height   hair
second  ivan    5     110  blond
fourth  lina   40     165  brown

In [64]:
# сброс индекса
df.reset_index()
df

        name  age  height   hair
first   mary   10     150  blond
second  ivan    5     110  blond
third   nick    3      65  black
fourth  lina   40     165  brown

In [65]:
# делаем новую колонку с использованием имеющихся
df['coef'] = df['height'] / df['age']
df

        name  age  height   hair       coef
first   mary   10     150  blond  15.000000
second  ivan    5     110  blond  22.000000
third   nick    3      65  black  21.666667
fourth  lina   40     165  brown   4.125000

In [67]:
# удалаяем колонку
df.drop(['coef'], axis = 'columns')

        name  age  height   hair
first   mary   10     150  blond
second  ivan    5     110  blond
third   nick    3      65  black
fourth  lina   40     165  brown

In [7]:
import datetime
from datetime import datetime
now = datetime.now()
print(f'Full time format of now is {now}')

Full time format of now is 2022-05-29 18:56:53.862731